namespace AxMyData.Models.Response
{

    /// <summary>
    /// 7 Σφάλματα (Αφορά ΜΟΝΟ business logic errors, όχι Τεχνικά Σφάλματα)
    /// <para>Τεχνικά Σφάλματα</para>
    /// <para>Τα τεχνικά σφάλματα χαρακτηρίζουν την κλήση ως μη επιτυχημένη και επιστρέφουν ένα τυπικό .ΝΕΤ HttpResponseMessage 
    /// αντί για το ErrorType που περιγράφεται στην παράγραφο 7. 
    /// Ως εκ τούτου δεν έχουν ειδικό κωδικό σφάλματος, 
    /// δεν συνοδεύονται από κάποιο statusCode του στοιχείου ResponseType, 
    /// και αναγνωρίζονται από το αντίστοιχο HttpStatusCode.</para>
    /// <para>Επιχειρησιακά Σφάλματα</para>
    /// <para>Κάθε στοιχείο σφάλματος που αφορά μια οντότητα αποτελείται από ένα μήνυμα που περιγράφει το σφάλμα και έναν κωδικό σφάλματος.</para>
    /// <para>Τα επιχειρησιακά σφάλματα είναι τύπου ErrorType (βλ Παρ. 7) και προκύπτουν κατά την αποτυχία των επιχειρησιακών ελέγχων. 
    /// Στην περίπτωση τους η κλήση θεωρείται τεχνικά επιτυχημένη (HTTP Response 200).</para>
    /// </summary>
    [Serializable]
    public class ErrorType
    {
        /// <summary>
        /// Κωδικός Σφάλματος
        /// </summary>
        public string code { get; set; }
        /// <summary>
        /// Μήνυμα Σφάλματος
        /// </summary>
        public string message { get; set; }
    }
}
